
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5093388499)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063b5de1a8e57c2f0]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09bbe5d247799c91a]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ac5af99053517d53]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02fded69eeafebfbb]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0094caf37924ecc1c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06780cdb2f9d2ac42]
aws_security_group.alb: Refreshing state... [id=sg-06b0acbe1b5245215]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9321dd4a0f03441]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07b8049beb4cc0f4d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0643033702df490c6]
aws_security_group.ecs: Refreshing state... [id=sg-01817104820a1c119]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f444d3d84593377a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d1f14784708f5dea]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0708ee74755483bb1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-038a3874d394ce238]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01847c06253f6a5a3]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1996458343]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c26045e1e6dc22eb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d77837d9b95e446b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e98de56a761ff0]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0708ee74755483bb11080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0775f5db85f86ab62]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0df4a6dc79f929b2b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-008b3aa7a98eb2dd6]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0094caf37924ecc1c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0643033702df490c61080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-06b0acbe1b5245215",
        ]
      + subnets                                     = [
          + "subnet-0c9321dd4a0f03441",
          + "subnet-0d1f14784708f5dea",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ac5af99053517d53"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:targetgroup/go-simple-server-target-group/35418404c280c12f]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Creation complete after 2m6s [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:loadbalancer/app/go-simple-server-alb/3d1a1e622fe088c7]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener-rule/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b/cd52e7adf398fad6]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"ccc5b21e0febc9d02c4da404ac8c1ad77c81ec42","Vars":{},"WorkflowName":"Terraform"} -->